Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/0.1/PIC32MZEF/atdf/PIC32MZ2048EFM100.atdf
         <register caption="Interrupt Vector Address Offset Registe" name="OFF034" offset="0x5c8" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF035" offset="0x5cc" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF036" offset="0x5d0" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF037" offset="0x5d4" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF038" offset="0x5d8" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF039" offset="0x5dc" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF040" offset="0x5e0" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF041" offset="0x5e4" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF042" offset="0x5e8" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF043" offset="0x5ec" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF044" offset="0x5f0" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF045" offset="0x5f4" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF046" offset="0x5f8" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF047" offset="0x5fc" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF048" offset="0x600" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF049" offset="0x604" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF050" offset="0x608" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF051" offset="0x60c" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF052" offset="0x610" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF053" offset="0x614" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF054" offset="0x618" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF055" offset="0x61c" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF056" offset="0x620" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF057" offset="0x624" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF058" offset="0x628" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF059" offset="0x62c" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF060" offset="0x630" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF061" offset="0x634" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF062" offset="0x638" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF063" offset="0x63c" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF064" offset="0x640" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF065" offset="0x644" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF066" offset="0x648" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF067" offset="0x64c" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
