Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/0.1/PIC32MZEF/atdf/PIC32MZ2048EFM100.atdf
      <value-group caption="Output Compare Peripheral On bit" name="OC2CON__ON">
         <value caption="Output Compare peripheral is enabled" name="" value="0x1"/>
         <value caption="Output Compare peripheral is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Output Compare Mode Select bits" name="OC3CON__OCM">
         <value caption="PWM mode on OCx; Fault pin enabled" name="" value="0x7"/>
         <value caption="PWM mode on OCx; Fault pin diabled" name="" value="0x6"/>
         <value caption="Initialize OCx pin low; generate continious output pulses on OCx pin" name="" value="0x5"/>
         <value caption="Initialize OCx pin low; generate single output pulse on OCx pin" name="" value="0x4"/>
         <value caption="Compare event toggles OCx pin" name="" value="0x3"/>
         <value caption="Initialize OCx pin high; compare event forces OCx pin low" name="" value="0x2"/>
         <value caption="Initialize OCx pin low; compare event forces OCx pin high" name="" value="0x1"/>
         <value caption="Output compare peripheral is disabled but continues to draw current" name="" value="0x0"/>
      </value-group>
      <value-group caption="Output Compare Timer Select bit(2)" name="OC3CON__OCTSEL">
         <value caption="Timery is the clock source for this Output Compare module" name="" value="0x1"/>
         <value caption="Timerx is the clock source for this Output Compare module" name="" value="0x0"/>
      </value-group>
      <value-group caption="PWM Fault Condition Status bit(1)" name="OC3CON__OCFLT">
         <value caption="PWM Fault condition has occurred (cleared in HW only)" name="" value="0x1"/>
         <value caption="No PWM Fault condition has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="32-bit Compare Mode bit" name="OC3CON__OC32">
         <value caption="OCxR and/or OCxRS&lt;31:0&gt; are used for comparisions to the 32-bit timer source" name="" value="0x1"/>
         <value caption="OCxR and OCxRS&lt;15:0&gt; are used for comparisons to the 16-bit timer source" name="" value="0x0"/>
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="OC3CON__SIDL">
         <value caption="Discontinue operation when CPU enters Idle mode" name="" value="0x1"/>
         <value caption="Continue operation in Idle mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="Output Compare Peripheral On bit" name="OC3CON__ON">
         <value caption="Output Compare peripheral is enabled" name="" value="0x1"/>
         <value caption="Output Compare peripheral is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Output Compare Mode Select bits" name="OC4CON__OCM">
         <value caption="PWM mode on OCx; Fault pin enabled" name="" value="0x7"/>
         <value caption="PWM mode on OCx; Fault pin diabled" name="" value="0x6"/>
         <value caption="Initialize OCx pin low; generate continious output pulses on OCx pin" name="" value="0x5"/>
         <value caption="Initialize OCx pin low; generate single output pulse on OCx pin" name="" value="0x4"/>
         <value caption="Compare event toggles OCx pin" name="" value="0x3"/>
         <value caption="Initialize OCx pin high; compare event forces OCx pin low" name="" value="0x2"/>
         <value caption="Initialize OCx pin low; compare event forces OCx pin high" name="" value="0x1"/>
         <value caption="Output compare peripheral is disabled but continues to draw current" name="" value="0x0"/>
      </value-group>
      <value-group caption="Output Compare Timer Select bit(2)" name="OC4CON__OCTSEL">
         <value caption="Timery is the clock source for this Output Compare module" name="" value="0x1"/>
         <value caption="Timerx is the clock source for this Output Compare module" name="" value="0x0"/>
      </value-group>
      <value-group caption="PWM Fault Condition Status bit(1)" name="OC4CON__OCFLT">
         <value caption="PWM Fault condition has occurred (cleared in HW only)" name="" value="0x1"/>
         <value caption="No PWM Fault condition has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="32-bit Compare Mode bit" name="OC4CON__OC32">
         <value caption="OCxR and/or OCxRS&lt;31:0&gt; are used for comparisions to the 32-bit timer source" name="" value="0x1"/>
         <value caption="OCxR and OCxRS&lt;15:0&gt; are used for comparisons to the 16-bit timer source" name="" value="0x0"/>
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="OC4CON__SIDL">
         <value caption="Discontinue operation when CPU enters Idle mode" name="" value="0x1"/>
         <value caption="Continue operation in Idle mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="Output Compare Peripheral On bit" name="OC4CON__ON">
         <value caption="Output Compare peripheral is enabled" name="" value="0x1"/>
         <value caption="Output Compare peripheral is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Output Compare Mode Select bits" name="OC5CON__OCM">
         <value caption="PWM mode on OCx; Fault pin enabled" name="" value="0x7"/>
         <value caption="PWM mode on OCx; Fault pin diabled" name="" value="0x6"/>
         <value caption="Initialize OCx pin low; generate continious output pulses on OCx pin" name="" value="0x5"/>
         <value caption="Initialize OCx pin low; generate single output pulse on OCx pin" name="" value="0x4"/>
         <value caption="Compare event toggles OCx pin" name="" value="0x3"/>
         <value caption="Initialize OCx pin high; compare event forces OCx pin low" name="" value="0x2"/>
         <value caption="Initialize OCx pin low; compare event forces OCx pin high" name="" value="0x1"/>
         <value caption="Output compare peripheral is disabled but continues to draw current" name="" value="0x0"/>
      </value-group>
      <value-group caption="Output Compare Timer Select bit(2)" name="OC5CON__OCTSEL">
         <value caption="Timery is the clock source for this Output Compare module" name="" value="0x1"/>
         <value caption="Timerx is the clock source for this Output Compare module" name="" value="0x0"/>
      </value-group>
      <value-group caption="PWM Fault Condition Status bit(1)" name="OC5CON__OCFLT">
         <value caption="PWM Fault condition has occurred (cleared in HW only)" name="" value="0x1"/>
         <value caption="No PWM Fault condition has occurred" name="" value="0x0"/>
      </value-group>
