Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/0.1/PIC32MZEF/atdf/PIC32MZ2048EFM100.atdf
         <register caption="" name="SBT5WR0" offset="0x8f48" rw="RW" size="4">
            <bitfield caption="Group 0 Write Permissions bits" mask="0x00000001" name="GROUP0" values="SBT5WR0__GROUP0"/>
            <bitfield caption="Group 1 Write Permissions bits" mask="0x00000002" name="GROUP1" values="SBT5WR0__GROUP1"/>
            <bitfield caption="Group 2 Write Permissions bits" mask="0x00000004" name="GROUP2" values="SBT5WR0__GROUP2"/>
            <bitfield caption="Group 3 Write Permissions bits" mask="0x00000008" name="GROUP3" values="SBT5WR0__GROUP3"/>
         </register>
         <register caption="" name="SBT5WR1" offset="0x8f68" rw="RW" size="4">
            <bitfield caption="Group 0 Write Permissions bits" mask="0x00000001" name="GROUP0" values="SBT5WR1__GROUP0"/>
            <bitfield caption="Group 1 Write Permissions bits" mask="0x00000002" name="GROUP1" values="SBT5WR1__GROUP1"/>
            <bitfield caption="Group 2 Write Permissions bits" mask="0x00000004" name="GROUP2" values="SBT5WR1__GROUP2"/>
            <bitfield caption="Group 3 Write Permissions bits" mask="0x00000008" name="GROUP3" values="SBT5WR1__GROUP3"/>
         </register>
         <register caption="" name="SBT5WR2" offset="0x8f88" rw="RW" size="4">
            <bitfield caption="Group 0 Write Permissions bits" mask="0x00000001" name="GROUP0" values="SBT5WR2__GROUP0"/>
            <bitfield caption="Group 1 Write Permissions bits" mask="0x00000002" name="GROUP1" values="SBT5WR2__GROUP1"/>
            <bitfield caption="Group 2 Write Permissions bits" mask="0x00000004" name="GROUP2" values="SBT5WR2__GROUP2"/>
            <bitfield caption="Group 3 Write Permissions bits" mask="0x00000008" name="GROUP3" values="SBT5WR2__GROUP3"/>
         </register>
         <register caption="" name="SBT6WR0" offset="0x9348" rw="RW" size="4">
            <bitfield caption="Group 0 Write Permissions bits" mask="0x00000001" name="GROUP0" values="SBT6WR0__GROUP0"/>
            <bitfield caption="Group 1 Write Permissions bits" mask="0x00000002" name="GROUP1" values="SBT6WR0__GROUP1"/>
            <bitfield caption="Group 2 Write Permissions bits" mask="0x00000004" name="GROUP2" values="SBT6WR0__GROUP2"/>
            <bitfield caption="Group 3 Write Permissions bits" mask="0x00000008" name="GROUP3" values="SBT6WR0__GROUP3"/>
         </register>
         <register caption="" name="SBT6WR1" offset="0x9368" rw="RW" size="4">
            <bitfield caption="Group 0 Write Permissions bits" mask="0x00000001" name="GROUP0" values="SBT6WR1__GROUP0"/>
            <bitfield caption="Group 1 Write Permissions bits" mask="0x00000002" name="GROUP1" values="SBT6WR1__GROUP1"/>
            <bitfield caption="Group 2 Write Permissions bits" mask="0x00000004" name="GROUP2" values="SBT6WR1__GROUP2"/>
            <bitfield caption="Group 3 Write Permissions bits" mask="0x00000008" name="GROUP3" values="SBT6WR1__GROUP3"/>
         </register>
         <register caption="" name="SBT7WR0" offset="0x9748" rw="RW" size="4">
            <bitfield caption="Group 0 Write Permissions bits" mask="0x00000001" name="GROUP0" values="SBT7WR0__GROUP0"/>
            <bitfield caption="Group 1 Write Permissions bits" mask="0x00000002" name="GROUP1" values="SBT7WR0__GROUP1"/>
            <bitfield caption="Group 2 Write Permissions bits" mask="0x00000004" name="GROUP2" values="SBT7WR0__GROUP2"/>
            <bitfield caption="Group 3 Write Permissions bits" mask="0x00000008" name="GROUP3" values="SBT7WR0__GROUP3"/>
         </register>
         <register caption="" name="SBT7WR1" offset="0x9768" rw="RW" size="4">
            <bitfield caption="Group 0 Write Permissions bits" mask="0x00000001" name="GROUP0" values="SBT7WR1__GROUP0"/>
            <bitfield caption="Group 1 Write Permissions bits" mask="0x00000002" name="GROUP1" values="SBT7WR1__GROUP1"/>
            <bitfield caption="Group 2 Write Permissions bits" mask="0x00000004" name="GROUP2" values="SBT7WR1__GROUP2"/>
            <bitfield caption="Group 3 Write Permissions bits" mask="0x00000008" name="GROUP3" values="SBT7WR1__GROUP3"/>
         </register>
         <register caption="" name="SBT8WR0" offset="0x9b48" rw="RW" size="4">
            <bitfield caption="Group 0 Write Permissions bits" mask="0x00000001" name="GROUP0" values="SBT8WR0__GROUP0"/>
            <bitfield caption="Group 1 Write Permissions bits" mask="0x00000002" name="GROUP1" values="SBT8WR0__GROUP1"/>
            <bitfield caption="Group 2 Write Permissions bits" mask="0x00000004" name="GROUP2" values="SBT8WR0__GROUP2"/>
            <bitfield caption="Group 3 Write Permissions bits" mask="0x00000008" name="GROUP3" values="SBT8WR0__GROUP3"/>
         </register>
         <register caption="" name="SBT8WR1" offset="0x9b68" rw="RW" size="4">
            <bitfield caption="Group 0 Write Permissions bits" mask="0x00000001" name="GROUP0" values="SBT8WR1__GROUP0"/>
            <bitfield caption="Group 1 Write Permissions bits" mask="0x00000002" name="GROUP1" values="SBT8WR1__GROUP1"/>
            <bitfield caption="Group 2 Write Permissions bits" mask="0x00000004" name="GROUP2" values="SBT8WR1__GROUP2"/>
            <bitfield caption="Group 3 Write Permissions bits" mask="0x00000008" name="GROUP3" values="SBT8WR1__GROUP3"/>
         </register>
         <register caption="" name="SBT9WR0" offset="0x9f48" rw="RW" size="4">
            <bitfield caption="Group 0 Write Permissions bits" mask="0x00000001" name="GROUP0" values="SBT9WR0__GROUP0"/>
            <bitfield caption="Group 1 Write Permissions bits" mask="0x00000002" name="GROUP1" values="SBT9WR0__GROUP1"/>
            <bitfield caption="Group 2 Write Permissions bits" mask="0x00000004" name="GROUP2" values="SBT9WR0__GROUP2"/>
            <bitfield caption="Group 3 Write Permissions bits" mask="0x00000008" name="GROUP3" values="SBT9WR0__GROUP3"/>
         </register>
         <register caption="" name="SBT9WR1" offset="0x9f68" rw="RW" size="4">
            <bitfield caption="Group 0 Write Permissions bits" mask="0x00000001" name="GROUP0" values="SBT9WR1__GROUP0"/>
            <bitfield caption="Group 1 Write Permissions bits" mask="0x00000002" name="GROUP1" values="SBT9WR1__GROUP1"/>
            <bitfield caption="Group 2 Write Permissions bits" mask="0x00000004" name="GROUP2" values="SBT9WR1__GROUP2"/>
            <bitfield caption="Group 3 Write Permissions bits" mask="0x00000008" name="GROUP3" values="SBT9WR1__GROUP3"/>
         </register>
         <register caption="" name="SBT10WR0" offset="0xa348" rw="RW" size="4">
            <bitfield caption="Group 0 Write Permissions bits" mask="0x00000001" name="GROUP0" values="SBT10WR0__GROUP0"/>
            <bitfield caption="Group 1 Write Permissions bits" mask="0x00000002" name="GROUP1" values="SBT10WR0__GROUP1"/>
            <bitfield caption="Group 2 Write Permissions bits" mask="0x00000004" name="GROUP2" values="SBT10WR0__GROUP2"/>
            <bitfield caption="Group 3 Write Permissions bits" mask="0x00000008" name="GROUP3" values="SBT10WR0__GROUP3"/>
         </register>
         <register caption="" name="SBT11WR0" offset="0xa748" rw="RW" size="4">
            <bitfield caption="Group 0 Write Permissions bits" mask="0x00000001" name="GROUP0" values="SBT11WR0__GROUP0"/>
            <bitfield caption="Group 1 Write Permissions bits" mask="0x00000002" name="GROUP1" values="SBT11WR0__GROUP1"/>
            <bitfield caption="Group 2 Write Permissions bits" mask="0x00000004" name="GROUP2" values="SBT11WR0__GROUP2"/>
            <bitfield caption="Group 3 Write Permissions bits" mask="0x00000008" name="GROUP3" values="SBT11WR0__GROUP3"/>
         </register>
         <register caption="" name="SBT11WR1" offset="0xa768" rw="RW" size="4">
            <bitfield caption="Group 0 Write Permissions bits" mask="0x00000001" name="GROUP0" values="SBT11WR1__GROUP0"/>
            <bitfield caption="Group 1 Write Permissions bits" mask="0x00000002" name="GROUP1" values="SBT11WR1__GROUP1"/>
            <bitfield caption="Group 2 Write Permissions bits" mask="0x00000004" name="GROUP2" values="SBT11WR1__GROUP2"/>
            <bitfield caption="Group 3 Write Permissions bits" mask="0x00000008" name="GROUP3" values="SBT11WR1__GROUP3"/>
         </register>
         <register caption="" name="SBT12WR0" offset="0xab48" rw="RW" size="4">
            <bitfield caption="Group 0 Write Permissions bits" mask="0x00000001" name="GROUP0" values="SBT12WR0__GROUP0"/>
            <bitfield caption="Group 1 Write Permissions bits" mask="0x00000002" name="GROUP1" values="SBT12WR0__GROUP1"/>
            <bitfield caption="Group 2 Write Permissions bits" mask="0x00000004" name="GROUP2" values="SBT12WR0__GROUP2"/>
            <bitfield caption="Group 3 Write Permissions bits" mask="0x00000008" name="GROUP3" values="SBT12WR0__GROUP3"/>
         </register>
         <register caption="" name="SBT13WR0" offset="0xaf48" rw="RW" size="4">
            <bitfield caption="Group 0 Write Permissions bits" mask="0x00000001" name="GROUP0" values="SBT13WR0__GROUP0"/>
            <bitfield caption="Group 1 Write Permissions bits" mask="0x00000002" name="GROUP1" values="SBT13WR0__GROUP1"/>
            <bitfield caption="Group 2 Write Permissions bits" mask="0x00000004" name="GROUP2" values="SBT13WR0__GROUP2"/>
            <bitfield caption="Group 3 Write Permissions bits" mask="0x00000008" name="GROUP3" values="SBT13WR0__GROUP3"/>
         </register>
      </register-group>
      <value-group caption="Target 0 Permission Group Violation Status bits" name="SBFLAG__T0PGV">
         <value caption="Target is reporting a Permission Group (PG) violation" name="" value="0x1"/>
         <value caption="Target is not reporting a PG violation" name="" value="0x0"/>
      </value-group>
